{
  "_class_name": "AsymmetricAutoencoderKL",
  "_diffusers_version": "0.30.2",
  "_name_or_path": "/mnt/bn/xiaowenpeng-bytenas-lq4/checkpoints/diffusers/models--cross-attention--asymmetric-autoencoder-kl-x-1-5/snapshots/8a721838bf5546eb21c954b66f37f531632b5737/",
  "act_fn": "silu",
  "block_out_channels": [
    192,
    384,
    768,
    768
  ],
  "down_block_out_channels": [
    128,
    256,
    512,
    512
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "force_upcast": false,
  "in_channels": 3,
  "latent_channels": 4,
  "layers_per_down_block": 2,
  "layers_per_up_block": 3,
  "norm_num_groups": 32,
  "out_channels": 6,
  "sample_size": 256,
  "scaling_factor": 0.18215,
  "up_block_out_channels": [
    192,
    384,
    768,
    768
  ],
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ]
}
